# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'caskroom/cask-versions'
tap 'homebrew/php'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/versions'
tap 'homebrew/services'
tap 'aurimasniekis/tap'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'awscli'
brew 'git'
brew 'git-flow'
brew 'hub' # wrapper for  git command
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'node'
brew 'trash'
brew 'wget'

# Java & X11
cask 'java'
cask 'xquartz'


# Utils
brew 'ack'
brew 'autoconf'
brew 'automake'
brew 'cmake'
brew 'crystal-lang'
brew 'curl' # write alias
brew 'diff-so-fancy'
brew 'dockutil'
brew 'elm'
brew 'ffmpeg'
brew 'go'
brew 'grc'
brew 'gpg'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'jsonpp'
brew 'nmap'
brew 'node'
brew 'peco'
brew 'pstree'
brew 'redis', restart_service: true
brew 'siege'
brew 'spark'
brew 'terminal-notifier'
brew 'unrar'
brew 'wallpaperutil'
brew 'watch'
brew 'youtube-dl'
brew 'z'

# PHP71
brew 'php71'
brew 'php71-ast'
brew 'php71-ev'
brew 'php71-imagick'
brew 'php71-intl'
brew 'php71-libsodium'
brew 'php71-opcache'
brew 'php71-pcntl'
brew 'php71-pdo-pgsql'
brew 'php71-redis'
brew 'php71-xdebug'

# Apps
cask "iterm2"
cask "google-chrome"
cask "1password"
cask "adobe-photoshop-cc"
cask "atom"
cask "appcleaner"
cask "calibre"
cask "dash"
cask "docker"
cask "firefox"
cask "flashlight"
cask "flux"
cask "gyazo"
cask "google-drive"
cask "google-japanese-ime"
cask "gpgtools"
cask "handbrake"
cask "hex-fiend"
cask "imagealpha"
cask "imageoptim"
cask "istat-menus"
cask "kaleidoscope"
cask "kitematic"
cask "launchcontrol"
cask "logitech-options"
cask "macdown"
cask "microsoft-lync"
cask "mysimbl"
cask "phpstorm"
cask "phpstorm-eap"
cask "postman"
cask "rubymine-eap"
cask "sequel-pro"
cask "sizeup"
cask "sketch"
cask "sketch-toolbox"
cask "skype"
cask "slack"
cask "sourcetree"
cask "spotify"
cask "textmate"
cask "textual"
cask "transmission"
cask "vagrant"
cask "virtualbox"
cask "viscosity"
cask "vlc"
cask "vmware-fusion"
cask "webstorm"
cask "whatsapp"


# Quick Look Plugins
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzipql'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'
cask 'quicklookase'
cask 'qlvideo'


# AppStore apps
mas 'gif keyboard', id: 1043270657
mas 'imovie', id: 408981434
mas 'keynote', id: 409183694
mas 'numbers', id: 409203825
mas 'pages', id: 409201541
mas 'shazam', id: 897118787
mas 'the unarchiver', id: 425424353
mas 'wake up time - Alarm clock', id: 495945638
mas 'xcode', id: 497799835

