# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'caskroom/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'caskroom/drivers'
tap 'homebrew/dupes'
tap 'homebrew/php'
tap 'homebrew/versions'
tap 'homebrew/services'
tap 'aurimasniekis/tap'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'
brew 'binutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'awscli'
brew 'git'
brew 'git-flow'
brew 'hub' # wrapper for  git command
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'node'
brew 'trash'
brew 'wget'

# Java & X11
cask 'java'
cask 'xquartz'

# Services
brew 'kibana',        restart_service: true
brew 'elasticsearch', restart_service: true
brew 'mysql',         restart_service: true
brew 'redis',         restart_service: true

# Libs
brew 'bdw-gc'
brew 'gmp'
brew 'jpeg'
brew 'libevent'
brew 'libxml2'
brew 'libyaml'

# Programming Languages
brew 'crystal-lang'
brew 'elm'
brew 'go'
brew 'python'

# Utils
brew 'ack'
brew 'autoconf'
brew 'automake'
brew 'cmake'
brew 'cocoapods'
brew 'curl'
brew 'diff-so-fancy'
brew 'dockutil'
brew 'ettercap'
brew 'ffmpeg'
brew 'git-quick-stats'
brew 'gnupg'
brew 'grc'
brew 'gpg'
brew 'highlight'
brew 'hostess'
brew 'htop'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'jsonpp'
brew 'llvm'
brew 'nmap'
brew 'node'
brew 'peco'
brew 'pstree'
brew 'siege'
brew 'sloccount'
brew 'spark'
brew 'terminal-notifier'
brew 'thefuck'
brew 'unrar'
brew 'wallpaperutil'
brew 'watch'
brew 'youtube-dl'
brew 'z'

# PHP
brew 'composer'

# PHP71
brew 'php71'
brew 'php71-ast'
brew 'php71-ev'
brew 'php71-imagick'
brew 'php71-intl'
brew 'php71-libsodium'
brew 'php71-mcrypt'
brew 'php71-memcached'
brew 'php71-mongodb'
brew 'php71-opcache'
brew 'php71-pcntl'
brew 'php71-pdo-pgsql'
brew 'php71-redis'
brew 'php71-xdebug'

# PHP72
brew 'php-version'
brew 'php72'
brew 'php72-ast'
brew 'php72-ev'
brew 'php72-igbinary'
brew 'php72-imagick'
brew 'php72-intl'
brew 'php72-libsodium'
brew 'php72-memcached'
brew 'php72-mongodb'
brew 'php72-opcache'
brew 'php72-pdo-pgsql'
brew 'php72-redis'
brew 'php72-xdebug', args: ['HEAD']

# Apps
cask '1password'
cask '1password-cli'
cask 'adobe-acrobat-pro'
cask 'adobe-photoshop-cc'
cask 'atom'
cask 'atom-beta'
cask 'appcleaner'
cask 'avocode'
cask 'calibre'
cask 'charles'
cask 'cyberduck'
cask 'dash'
cask 'docker'
cask 'firefox'
cask 'flashlight'
cask 'flux'
cask 'geekbench'
cask 'google-chrome'
cask 'google-drive'
cask 'google-japanese-ime'
cask 'gpgtools'
cask 'gyazo'
cask 'handbrake'
cask 'hex-fiend'
cask 'imagealpha'
cask 'imageoptim'
cask 'inkscape'
cask 'istat-menus'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'kaleidoscope'
cask 'kitematic'
cask 'launchcontrol'
cask 'league-of-legends'
cask 'logitech-options'
cask 'macdown'
cask 'microsoft-lync'
cask 'mono-mdk'
cask 'mysimbl'
cask 'openemu'
cask 'phpstorm'
cask 'phpstorm-eap'
cask 'postico'
cask 'postman'
cask 'robo-3t'
cask 'sequel-pro'
cask 'sizeup'
cask 'sketch'
cask 'sketch-toolbox'
cask 'skype'
cask 'slack'
cask 'sourcetree'
cask 'spotify'
cask 'studio-3t'
cask 'teamviewer'
cask 'textmate'
cask 'textual'
cask 'transmission'
cask 'vagrant'
cask 'virtualbox'
cask 'viscosity'
cask 'vlc'
cask 'vmware-fusion'
cask 'webstorm'
cask 'whatsapp'
cask 'xmplify'


# Quick Look Plugins
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzipql'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'
cask 'quicklookase'
cask 'qlvideo'


# AppStore apps
mas 'gif keyboard', id: 1043270657
mas 'iMovie', id: 408981434
mas 'Keynote', id: 409183694
mas 'LINE', id: 539883307
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Shazam', id: 897118787
mas 'Tenor', id: 1043270657
mas 'The Unarchiver', id: 425424353
mas 'Wake Up Time', id: 495945638
mas 'Xcode', id: 497799835

